#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Sat Apr 25 17:44:29 2026

add_design "C:/Users/happuking/Desktop/source/CPU.v"
set_global_include C:/Users/happuking/Desktop/source/CPU.v true
set_global_include C:/Users/happuking/Desktop/source/CPU.v false
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -top_module led_top
add_constraint "C:/Users/happuking/Desktop/FPGA-CPU.fdc"
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -top_module led_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module led_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/happuking/Desktop/FPGA-CPU/source/wb_ram.v"
add_design "C:/Users/happuking/Desktop/FPGA-CPU/source/VexRiscv.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
remove_constraint -force -logic -fdc "C:/Users/happuking/Desktop/FPGA-CPU/FPGA-CPU.fdc"
add_constraint "C:/Users/happuking/Desktop/FPGA-CPU/FPGA-CPU.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/happuking/Desktop/FPGA-CPU/source/uart_wb.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
